# Задание 1 
# Пользователь вводит с клавиатуры три числа. В зависимости от выбора пользователя программа выводит
# на экран сумму трёх чисел или произведение трёх чисел.

# x = int(input("введите число: "))
# y = int(input("введите число: "))
# z = int(input("введите число: "))
# s = int(input("0 - сумма, 1 - произведение"))
# if s == 0:
#     print(x + y + z)
# elif s == 1:
#     print(x * y * z)
# else:
#     print("введите корректное значение")

# Задание 2 
# Пользователь вводит с клавиатуры три числа. В зависимости от выбора пользователя программа выводит
# на экран максимум из трёх, минимум из трёх или среднеарифметическое трёх чисел.

# x = int(input("введите число: "))
# y = int(input("введите число: "))
# z = int(input("введите число: "))
# s = int(input("0 - max, 1 - min, 2 - среднефрифметическое "))
# if s == 0:
#     print(max(x,y,z))
# elif s == 1:
#     print(min(x,y,z))
# elif s == 2:
#     print(int((x + y + z) / 2))
# else:
#     print("введите корректное значение")

# Задание 3
# Пользователь вводит с клавиатуры количество метров. В зависимости от выбора пользователя программа
# переводит метры в мили, дюймы или ярды.

# x = int(input("введите сколько метров: "))
# s = int(input("0 - мили, 1 - дюймы, 2 - ярды "))
# if s == 0:
#     print(x * 0.000621)
# elif s == 1:
#     print(x * 39.37)
# elif s == 2:
#     print(x * 1.093613)
# else:
#     print("введите корректное значение")