# Задание 1
# Пользователь вводит с клавиатуры три числа. Необходимо найти сумму чисел, произведение чисел. Результат
# вычислений вывести на экран.

# x = int(input("введите число: "))
# y = int(input("введите число: "))
# s = int(input("введите число: "))
# print(x + y + s)
# print(x * y * s)


# Задание 2
# Пользователь вводит с клавиатуры три числа. Первое
# число — зарплата за месяц, второе число — сумма месячного платежа по кредиту в банке, третье число — задолженность за коммунальные услуги. Необходимо вывести
# на экран сумму, которая останется у пользователя после
# всех выплат.

# x = int(input("введите зп за месяц: "))
# y = int(input("введите сумму месяцного платежа по кредиту: "))
# z = int(input("введите задолженность за комунальные услуги: "))
# print(x-y-z,"остаток")

# Задание 3
# Напишите программу, вычисляющую площадь ромба. Пользователь с клавиатуры вводит длину двух его
# диагоналей.

# x = int(input("введите длину диагонали: "))
# y = int(input("введите длину диагонали: "))
# sum = int((x*y) / 2)
# print("площадь ромба ровна:", sum)

# Задание 4
# Выведите на экран надпись To be or not to be на разных
# строках.

# print("To be")
# print("or not")
# print("to be")

# Задание 5
# Выведите на экран надпись «Life is what happens when
# you're busy making other plans» John Lennon на разных
# строках.

# print('"' + "Life is what happens")
# print("    when")
# print("        you're busy making other plans" + '"')
# print("                                     John Lennon.")